In [1]:
import pandas as pd
# there are many ways to make dataframes; one is by 2D Dictionary
dict1 = {'Student':['Shahzaneer','Rameez','Daoud'],
         'College':['GCU','MAO','Cambridge'],
         'Marks':[90,85,82]
        }
dict1 #a 2D dictionary (aik listing item k ander mazeed aik listing item)

{'Student': ['Shahzaneer', 'Rameez', 'Daoud'],
 'College': ['GCU', 'MAO', 'Cambridge'],
 'Marks': [90, 85, 82]}

In [2]:
df = pd.DataFrame(dict1)
df #jo keys hain wo headings bn jayengi aur values biltarteeb likhi hui ayengi aur values per by default indexing 0 se start 
#hoker hojayegi

      Student    College  Marks
0  Shahzaneer        GCU     90
1      Rameez        MAO     85
2       Daoud  Cambridge     82

In [3]:
#dataframe from a 2D dictionary having values as a dictionary object
dict2 = {'Shahzaneer':{'College':'GCU','University':'CUI','StudentClub':'GDSC'},
         'Rameez':{'College':'MAO','University':'GCU','StudentClub':'IEEE'}
        }

df2 = pd.DataFrame(dict2)
df2
# parent keys column ki headings bn gyin aur jo child keys thin heading tou unho ne bnna hi tha wo bnni rows ki headings
# note that k yeh same thin tou aik hi baar aayein

            Shahzaneer Rameez
College            GCU    MAO
University         CUI    GCU
StudentClub       GDSC   IEEE

In [5]:
# ab bilfarz yeh ultin hon 
dict2 = {'Shahzaneer':{'College':'GCU','University':'CUI','StudentClub':'GDSC'},
         'Rameez':{'College':'MAO','StudentClub':'IEEE','University':'GCU'}
        }
df3 = pd.DataFrame(dict2)
df3
# koi farq na parega isse!

            Shahzaneer Rameez
College            GCU    MAO
University         CUI    GCU
StudentClub       GDSC   IEEE

In [6]:
# ager koi missing ho
dict2 = {'Shahzaneer':{'College':'GCU','University':'CUI','StudentClub':'GDSC'},
         'Rameez':{'College':'MAO','University':'GCU'}
        }
df4 = pd.DataFrame(dict2)
df4
# jo cheez missing hogi uske saath NaN (not A Number) likha hua hoga!

            Shahzaneer Rameez
College            GCU    MAO
University         CUI    GCU
StudentClub       GDSC    NaN

In [13]:
dict2 = {'Shahzaneer':{'College':'GCU','University':'CUI','StudentClub':'GDSC'},
         'Rameez':{'College':'MAO','University':'GCU','Company':'Systems Limited'}
        }
df5 = pd.DataFrame(dict2)
df5
# ab keys rows ki headings tou banengi aur jiske adjacent koi value na hogi tou NaN ayega

            Shahzaneer           Rameez
College            GCU              MAO
University         CUI              GCU
StudentClub       GDSC              NaN
Company            NaN  Systems Limited